AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
static uint16_t Get_Target_Kill_Score(TargetType type)
{
    if (type == TARGET_TYPE_ADVANCED)   return TARGET_SCORE_ADVANCED;
    if (type == TARGET_TYPE_BOSS)       return TARGET_SCORE_BOSS;
    else                                return TARGET_SCORE_NORMAL;
}

// Reference: Unit 3.2 Joystick

/**
 * @brief Check if two circles overlap (for collision detection)
 * 
 * Two circles collide when the distance between their centers is less than
 * the sum of their radii. This function calculates the squared distance to
 * avoid expensive sqrt() operations - we compare squared distances instead.
 * 
 * @param x1, y1 Center coordinates of first circle
 * @param x2, y2 Center coordinates of second circle
 * @param r1, r2 Radii of the two circles
 * @return 1 if circles overlap, 0 otherwise
 */
uint8_t Circles_Overlap(uint16_t x1, uint16_t y1, uint16_t r1,
                        uint16_t x2, uint16_t y2, uint16_t r2)
{
  int32_t dx = (int32_t)x2 - (int32_t)x1;
  int32_t dy = (int32_t)y2 - (int32_t)y1;
  int32_t dist_squared = (dx * dx) + (dy * dy);
  int32_t radii_sum = r1 + r2;
  int32_t radii_sum_squared = radii_sum * radii_sum;
  
  return (dist_squared <= radii_sum_squared) ? 1 : 0;
}

/**
 * @brief Place a target at a random screen location that doesn't collide with player or other targets
 * 
 * This function uses a trial-and-error approach to find a valid spawn location:
 * 1) Generate random X/Y pixel coordinates within screen bounds
 * 2) Check if the location collides with the player using circle overlap detection
 * 3) Check if the location collides with any other targets
 * 4) If no collision, place the target and draw it on screen
 * 5) If collision detected, try again (up to 100 attempts)
 * 
 * The collision checking uses circle overlap: two circles collide if the distance
 * between their centers is less than the sum of their radii. This creates smooth,
 * natural-feeling collisions rather than harsh grid-based detection.
 * 
 * @param index Which target slot (0 to TARGET_COUNT-1) to place
 * @param target_x Array holding X pixel positions of all targets
 * @param target_y Array holding Y pixel positions of all targets
 * @param player_x Current player X position (to avoid spawning on player)
 * @param player_y Current player Y position
 */
void Place_Target(uint8_t index,
                  uint16_t *target_x,
                  uint16_t *target_y,
                  TargetType *target_type,
                  int16_t *target_hp,
                  uint32_t *target_last_fire_tick,
                  uint16_t player_x,
                  uint16_t player_y,
                  const GameDifficulty *difficulty)
{
    uint8_t tries = 0;
    TargetType picked_type = Pick_Target_Type(difficulty);
    uint8_t spawn_radius = Get_Target_Radius(picked_type);
    uint8_t spawn_color = Get_Target_Color(picked_type);
    const uint16_t min_spacing = (PLAYER_RADIUS + TARGET_BOSS_RADIUS);
    const uint16_t top_spawn_y = PLAY_AREA_Y0 + spawn_radius;

    while (tries < 100)
    {
        // Generate random position within play area, with margins for the target radius
        uint16_t x = Random_U16(LCD_WIDTH - 2 * spawn_radius) + spawn_radius;
        uint16_t y = top_spawn_y;

        // Check collision with player
        uint8_t collision = Circles_Overlap(x, y, min_spacing / 2, player_x, player_y, PLAYER_RADIUS);
        
        // Check collision with other targets
        if (!collision)
        {
            for (uint8_t i = 0; i < TARGET_COUNT; i++)
            {
                if (i == index) continue;
                if (target_y[i] != 0 &&
                    Circles_Overlap(x, y, spawn_radius, 
                                    target_x[i], target_y[i], 
                                    Get_Target_Radius(target_type[i])))
                {
                    collision = 1;
                    break;
                }
            }
        }

        if (!collision)
        {
            target_x[index] = x;
            target_y[index] = y;
            target_type[index] = picked_type;
            target_hp[index] = Get_Target_Initial_HP(picked_type);
            target_last_fire_tick[index] = HAL_GetTick();

            LCD_Draw_Circle(x, y, spawn_radius, spawn_color, 1);
            return;
        }

        tries++;
    }
}



MenuState Game1_Run(void) 
{
    SubMenuSystem submenu;
    SubMenuState selected_mode;
    Joystick_t joystick_data;

    SubMenu_Init(&submenu);

    // 外部循环：子菜单选择模式；游戏内BT3返回这里 
    // 内部循环：运行实际游戏，直到BT3按下返回子菜单
    // Outer loop: submenu selects mode; gameplay BT3 returns here.
    // Inner loop: runs the actual game until BT3 is pressed to return to submenu.
    while (1) {
        selected_mode = SubMenu_Run(&submenu);
        if (selected_mode == SUBMENU_1_STATE_HOME || selected_mode == SUBMENU_1_STATE_RETURN_MAIN) {
            return MENU_STATE_HOME;
        }

        GameDifficulty difficulty = Get_Difficulty_From_Mode(selected_mode);

        // Play a brief startup sound
        buzzer_tone(&buzzer_cfg, 1000, 30);  // 1kHz at 30% volume
        HAL_Delay(50);  // Brief beep duration
        buzzer_off(&buzzer_cfg);  // Stop the buzzer

        // ===== Initialize Game =====
        LCD_Fill_Buffer(0);
        
        // Initialize player at center of screen
        uint16_t player_x = LCD_WIDTH / 2;
        uint16_t player_y = LCD_HEIGHT / 2;
        uint16_t prev_player_x = player_x;
        uint16_t prev_player_y = player_y;
        uint32_t last_move_tick = HAL_GetTick();
        // Draw player
        LCD_Draw_Circle(player_x, player_y, PLAYER_RADIUS, PLAYER_COLOR, 1);

        // Initial targets
        uint16_t target_x[TARGET_COUNT] = {0};
        uint16_t target_y[TARGET_COUNT] = {0};
        TargetType target_type[TARGET_COUNT] = {TARGET_TYPE_NORMAL};
        int16_t target_hp[TARGET_COUNT] = {0};
        uint32_t target_last_fire_tick[TARGET_COUNT] = {0};
        uint32_t last_target_move_tick = HAL_GetTick();
        for (uint8_t i = 0; i < TARGET_COUNT; i++)
        {
            Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                         player_x, player_y, &difficulty);
        }

