AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
        // Initialize bullet
        uint16_t bullet_x[MAX_BULLETS] = {0};
        int16_t bullet_y[MAX_BULLETS] = {0};
        uint8_t bullet_active[MAX_BULLETS] = {0};
        uint32_t last_bullet_move_tick = HAL_GetTick();

        // Initialize boss bullets
        uint16_t enemy_bullet_x[MAX_ENEMY_BULLETS] = {0};
        int16_t enemy_bullet_y[MAX_ENEMY_BULLETS] = {0};
        uint8_t enemy_bullet_active[MAX_ENEMY_BULLETS] = {0};

        // Initialize score & life
        uint16_t score = 0;
        int16_t lives = PLAYER_HP;
        char hud_str[64];
        if (difficulty.win_score > 0)
        {
            sprintf(hud_str, "%s  %2d/%3d  L:%2d", difficulty.mode_name, score, difficulty.win_score, lives);
        }
        else
        {
            sprintf(hud_str, "INF  %2d  L:%2d", score, lives);
        }
        LCD_Draw_Rect(0, 0, LCD_WIDTH, 25, 0, 1);
        LCD_printString(hud_str, HUD_OFFSET_X, HUD_OFFSET_Y, 1, 2);

        // Initialize button hold tracking for returning to submenu
        uint32_t btn3_press_start_ms = 0;   // 按下开始时间
        uint32_t btn3_hold_ms = 0;          // 已按住的时间
        char btn_hold_str[64];

        LCD_Draw_Rect(0, LCD_HEIGHT - 20, LCD_WIDTH, 20, 0, 1);
        LCD_printString("Hold BT3 to return", 10, 220, 1, 1);

        LCD_Refresh(&cfg0);

        // Game loop
        while (1) 
        {
            uint32_t frame_start = HAL_GetTick();

            // Read input
            Input_Read();

            // 按下瞬间 -> 记录起始时间
            if (current_input.btn3_pressed) btn3_press_start_ms = frame_start;
            // 如果已经开始计时
            if (btn3_press_start_ms != 0) 
            {
                // Read GPIO 是否仍然按住
                if (HAL_GPIO_ReadPin(BTN3_GPIO_Port, BTN3_Pin) == GPIO_PIN_RESET)
                {
                    btn3_hold_ms = frame_start - btn3_press_start_ms;
                    sprintf(btn_hold_str,
                            "Hold BT3: %lu / %u ms",
                            btn3_hold_ms, BTN3_HOLD_MS);

                    LCD_Draw_Rect(0, LCD_HEIGHT - 20, LCD_WIDTH, 20, 0, 1);
                    LCD_printString(btn_hold_str, 10, 220, 1, 1);

                    if (btn3_hold_ms >= BTN3_HOLD_MS) {
                        break;
                    }
                }
                else // 松手 -> 清零
                {
                    btn3_press_start_ms = 0;
                    btn3_hold_ms = 0;
                    LCD_Draw_Rect(0, LCD_HEIGHT - 20, LCD_WIDTH, 20, 0, 1);
                    // LCD_printString("Hold BT3 to return", 10, 220, 1, 1);
                }
            }

            // ===== STEP 1: Read Joystick Input =====
            Joystick_Read(&joystick_cfg, &joystick_data);

            // ===== STEP 2: Player Movement (Rate-Limited) =====
            // Only allow movement every MOVE_DELAY_MS milliseconds to control game speed
            if ((frame_start - last_move_tick) >= MOVE_DELAY_MS && joystick_data.direction != CENTRE)
            {
            // Calculate movement delta based on joystick direction
            // dx/dy represent pixel movement in X and Y directions
            int16_t dx = 0;
            int16_t dy = 0;

            switch (joystick_data.direction)
            {
                case N:  dy = -MOVE_SPEED; break;
                case NE: dy = -MOVE_SPEED; dx =  MOVE_SPEED; break;
                case E:  dx =  MOVE_SPEED; break;
                case SE: dy =  MOVE_SPEED; dx =  MOVE_SPEED; break;
                case S:  dy =  MOVE_SPEED; break;
                case SW: dy =  MOVE_SPEED; dx = -MOVE_SPEED; break;
                case W:  dx = -MOVE_SPEED; break;
                case NW: dy = -MOVE_SPEED; dx = -MOVE_SPEED; break;
                default: break;
            }

            // Apply movement if joystick is deflected
            if (dx != 0 || dy != 0)
            {
                int32_t new_x = (int32_t)player_x + dx;
                int32_t new_y = (int32_t)player_y + dy;

                // Clamp position to screen boundaries (prevent player from leaving the display)
                // Keep player radius away from edges so the full circle stays visible
                // 将位置限制在屏幕边界内（防止玩家离开屏幕）
                // 保持玩家半径远离边缘，以便整个圆圈始终可见
                if (new_x < PLAYER_RADIUS) new_x = PLAYER_RADIUS;
                if (new_x >= (LCD_WIDTH - PLAYER_RADIUS)) new_x = LCD_WIDTH - PLAYER_RADIUS - 1;
                if (new_y < (PLAY_AREA_Y0 + PLAYER_RADIUS)) new_y = PLAY_AREA_Y0 + PLAYER_RADIUS;
                if (new_y >= (LCD_HEIGHT - PLAYER_RADIUS)) new_y = LCD_HEIGHT - PLAYER_RADIUS - 1;

                player_x = (uint16_t)new_x;
                player_y = (uint16_t)new_y;
            }

            last_move_tick = frame_start;
            }

            // ===== STEP 3: Render Player Movement =====
            // Only redraw if player actually moved (avoids unnecessary LCD operations)
            // 仅当玩家实际移动时才重新绘制（避免不必要的 LCD 操作）
            if (player_x != prev_player_x || player_y != prev_player_y)
            {
                // Erase player at old position (draw circle in background color)
                // Draw player at new position (draw circle in player color)
                // 擦除玩家上一帧的图像（以背景色绘制圆圈）
                // 在新位置绘制玩家（用玩家颜色绘制圆圈）                
                LCD_Draw_Circle(prev_player_x, prev_player_y, PLAYER_RADIUS, 0, 1);
                LCD_Draw_Circle(player_x, player_y, PLAYER_RADIUS, PLAYER_COLOR, 1);

                prev_player_x = player_x;
                prev_player_y = player_y;
            }

            // ===== STEP 4: Bullet Create and Movement =====
            // Update - fire
            bool fired = false;
            if ((frame_start - last_bullet_move_tick) >= difficulty.bullet_fire_interval_ms)
            {
                for (uint8_t i = 0; i < MAX_BULLETS; i++)
                {
                    if (!bullet_active[i])
                    {
                        bullet_x[i] = player_x;
                        bullet_y[i] = (int16_t)player_y - PLAYER_RADIUS - BULLET_RADIUS;
                        bullet_active[i] = 1;
                        fired = true;
                        break;
                    }
                }
                if (fired) last_bullet_move_tick = frame_start;
            }

            // Update - move
            for (uint8_t i = 0; i < MAX_BULLETS; i++)
            {
                // Old position for bullet (used to erase previous frame)
                if (!bullet_active[i]) continue;
                LCD_Draw_Circle(bullet_x[i], (uint16_t)bullet_y[i], BULLET_RADIUS, 0, 1);

                // New position for bullet (move up)
                bullet_y[i] -= BULLET_SPEED;
                if (bullet_y[i] <= (PLAY_AREA_Y0 + BULLET_RADIUS)) 
                {
                    bullet_active[i] = 0;
                }
                else
                {
                    LCD_Draw_Circle(bullet_x[i], (uint16_t)bullet_y[i], BULLET_RADIUS, 3, 1);
                }
            }

            // ===== STEP 5: Target Falling Movement =====
            if ((frame_start - last_target_move_tick) >= difficulty.target_move_delay_ms)
            {
                for (uint8_t i = 0; i < TARGET_COUNT; i++)
                {
                    uint8_t radius = Get_Target_Radius(target_type[i]);
                    uint8_t color = Get_Target_Color(target_type[i]);

