AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
                    LCD_Draw_Circle(target_x[i], target_y[i], radius, 0, 1);

                    uint16_t new_target_y = target_y[i] + difficulty.target_fall_speed;
                    if (new_target_y >= (LCD_HEIGHT - radius))
                    {
                        Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                                     player_x, player_y, &difficulty);
                        continue;
                    }

                    target_y[i] = new_target_y;
                    LCD_Draw_Circle(target_x[i], target_y[i], radius, color, 1);

                    // Boss bullet spawn
                    if (target_type[i] == TARGET_TYPE_BOSS &&
                        (frame_start - target_last_fire_tick[i]) >= difficulty.boss_fire_interval_ms)
                    {
                        for (uint8_t j = 0; j < MAX_ENEMY_BULLETS; j++)
                        {
                            if (!enemy_bullet_active[j])
                            {
                                enemy_bullet_x[j] = target_x[i];
                                enemy_bullet_y[j] = (int16_t)target_y[i] + radius + ENEMY_BULLET_RADIUS;
                                enemy_bullet_active[j] = 1;
                                target_last_fire_tick[i] = frame_start;
                                break;
                            }
                        }
                    }
                }

            last_target_move_tick = frame_start;
            }

            // Boss bullet movement and collision (same hit behavior: touch player costs life)
            for (uint8_t k = 0; k < MAX_ENEMY_BULLETS; k++)
            {
                if (!enemy_bullet_active[k]) continue;

                LCD_Draw_Circle(enemy_bullet_x[k], (uint16_t)enemy_bullet_y[k], ENEMY_BULLET_RADIUS, 0, 1);
                enemy_bullet_y[k] += ENEMY_BULLET_SPEED;

                if (enemy_bullet_y[k] >= (LCD_HEIGHT - ENEMY_BULLET_RADIUS))
                {
                    enemy_bullet_active[k] = 0;
                    continue;
                }

                if (Circles_Overlap(player_x, player_y, PLAYER_RADIUS,
                                    enemy_bullet_x[k], (uint16_t)enemy_bullet_y[k], ENEMY_BULLET_RADIUS))
                {
                    enemy_bullet_active[k] = 0;
                    lives--;
                    continue;
                }

                LCD_Draw_Circle(enemy_bullet_x[k], (uint16_t)enemy_bullet_y[k], 
                            ENEMY_BULLET_RADIUS, ENEMY_BULLET_COLOR, 1);
            }

            // ===== STEP -2: Collision Detection =====
            // Circle overlap collision: check if circles touch or overlap
            // Two circles collide when distance between centers < sum of radii
            // 圆重叠碰撞检测：检查圆是否接触或重叠
            // 当两个圆心之间的距离小于半径之和时，这两个圆会发生碰撞。            
            for (uint8_t i = 0; i < TARGET_COUNT; i++)
            {
                uint8_t target_radius = Get_Target_Radius(target_type[i]);

                // Check if player circle overlaps with target
                if (Circles_Overlap(player_x, player_y, PLAYER_RADIUS, 
                                    target_x[i], target_y[i], target_radius))
                {
                    // When the player collides with the enemy, Erase enemy
                    LCD_Draw_Circle(target_x[i], target_y[i], target_radius, 0, 1);
                    Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                                 player_x, player_y, &difficulty);

                    score++;
                    lives--; // Decrease lives when player collides with target
                }

                // Check if any active bullets overlap with target
                for (uint8_t b = 0; b < MAX_BULLETS; b++)
                {
                    if (!bullet_active[b]) continue;

                    if (Circles_Overlap(bullet_x[b], bullet_y[b], BULLET_RADIUS,
                                        target_x[i], target_y[i], target_radius))
                    {
                        // When the bullet collides with the enemy, Erase bullet
                        LCD_Draw_Circle(target_x[i], target_y[i], target_radius, 0, 1);
                        LCD_Draw_Circle(bullet_x[b], (uint16_t)bullet_y[b], BULLET_RADIUS, 0, 1);
                        bullet_active[b] = 0;

                        target_hp[i]--;

                        if (target_hp[i] <= 0)
                        {
                            score += Get_Target_Kill_Score(target_type[i]);
                            Place_Target(i, target_x, target_y, target_type, target_hp, target_last_fire_tick,
                                         player_x, player_y, &difficulty);
                        }
                        else
                        {
                            LCD_Draw_Circle(target_x[i], target_y[i], target_radius, Get_Target_Color(target_type[i]), 1);
                        }

                        break;
                    }
                }
            }                        
            if (difficulty.win_score > 0)
            {
                sprintf(hud_str, "%s  %2d/%3d  L:%2d", difficulty.mode_name, score, difficulty.win_score, lives);
            }
            else
            {
                sprintf(hud_str, "INF  %2d  L:%2d", score, lives);
            }
            LCD_Draw_Rect(0, 0, LCD_WIDTH, 25, 0, 1);
            LCD_printString(hud_str, HUD_OFFSET_X, HUD_OFFSET_Y, 1, 2);


            // ===== STEP -1: Update Display =====
            // Transfer the frame buffer to the LCD hardware (makes all draws visible)
            LCD_Refresh(&cfg0);

            // // UPDATE: Game logic
            // animation_counter++;

            // // Simple animation: move object back and forth
            // moving_x += move_direction * move_step;
            // if (moving_x >= 200 || moving_x <= 0) {
            //     move_direction *= -1;
            // }

            // Example: Vary LED brightness based on animation
            // uint8_t brightness = (moving_x * 100) / 200;
            // PWM_SetDuty(&pwm_cfg, brightness);

            // // RENDER: Draw to LCD
            // LCD_Fill_Buffer(0);

