AllogeneSSRD/STM32-Game-Engine/Menu_Template/game_1/Game_1.c
            // // Title
            // LCD_printString("GAME 1", 60, 10, 1, 3);
            // LCD_printString((char*)mode_options[selected_mode - SUBMENU_1_STATE_1], 60, 45, 1, 2);

            // // Simple animated object (moving box)
            // LCD_printString("[*]", 20 + moving_x, 100, 1, 3);

            // // Display counter
            // char counter[32];
            // sprintf(counter, "Frame: %lu", animation_counter);
            // LCD_printString(counter, 50, 150, 1, 2);

            // // Show PWM LED usage
            // LCD_printString("LED: PWM Demo", 30, 180, 1, 1);
            // char pwm_str[32];
            // sprintf(pwm_str, "Brightness: %d%%", brightness);
            // LCD_printString(pwm_str, 30, 195, 1, 1);

            // // Instructions
            // LCD_printString("Press BT3 to", 40, 210, 1, 1);
            // LCD_printString("Back to Mode Menu", 20, 225, 1, 1);

            // LCD_Refresh(&cfg0);

            // Frame timing - wait for remainder of frame time
            uint32_t frame_time = HAL_GetTick() - frame_start;
            if (frame_time < GAME1_FRAME_TIME_MS) {
                HAL_Delay(GAME1_FRAME_TIME_MS - frame_time);
            }
            // Exit game loop when player has no lives left
            if (lives <= 0)
            {
                // Game over
                buzzer_note(&buzzer_cfg, NOTE_A4, 60);
                LCD_Fill_Buffer(0);
                LCD_printString("GAME OVER", 40, 120, 15, 3);
                LCD_Refresh(&cfg0);
                HAL_Delay(2000);
                buzzer_off(&buzzer_cfg);

                LCD_Fill_Buffer(0);
                LCD_printString("BACK TO MENU...", 20, 120, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(1000);
                break;
            }

            // For easy/hard mode: exit loop when reaching target score
            if (difficulty.win_score > 0 && score >= difficulty.win_score)
            {
                buzzer_tone(&buzzer_cfg, 1500, 35);
                LCD_Fill_Buffer(0);
                LCD_printString("YOU WIN", 60, 110, 2, 3);
                LCD_printString((char*)difficulty.mode_name, 70, 145, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(3000);
                buzzer_off(&buzzer_cfg);

                LCD_Fill_Buffer(0);
                LCD_printString("BACK TO MENU...", 20, 120, 1, 2);
                LCD_Refresh(&cfg0);
                HAL_Delay(1000);
                break;
            }
        }
    }
}
